/*******************************************************************************************
 **@ file  : Service_Crc.h
 **@ author: YDX
 **@ create: 2018-6-18
 *******************************************************************************************/


#ifndef _SERVICE_CRC_H_
#define _SERVICE_CRC_H_

#ifdef __cplusplus

extern "C"{

#endif

/*---------------------------------Hal外部接口-------------------------------------------------------------*/


/*********************************************************************************************************
** @函数名称:  CalcCrc；
** @函数功能:  将一个字节加入到CRC
** @入口参数:  niCrc     原来CRC结果；
** @           cCrcData  新加入数据
** @出口参数:  无；
** @返回值　:  新的CRC结果;
*********************************************************************************************************/
unsigned short int CalcCrc(unsigned short int niCrc,unsigned char cCrcData);     //将一个字节加入到CRC



/*********************************************************************************************************
** @函数名称:  CalcCrcAll；
** @函数功能:  计算一串数据的CRC
** @入口参数:  nCrc    CRC初始值；
** @           cData   CRC数据指针
** @           cCount  CRC数据数量
** @出口参数:  无；
** @返回值　:  CRC结果;
*********************************************************************************************************/
unsigned short int CalcCrcAll(unsigned short int nCrc,unsigned char * cData,unsigned short int cCount);

#ifdef __cplusplus

}

#endif

#endif
